<?php
$key = [
    "作者"=>"易对接后台开发者:初陌",
    "运营时长"=>"易对接后台上市时间为2020年1月5日，目前还在提供着后台服务",
    "域名"=>"iappn.com appdoc.top www.appdoc.top，这是后台的三个域名，推荐使用com的域名",
    "官网"=>"后台官网链接:https://iappn.com",
    "在不"=>"我在的，有什么问题请尽管提出，我们会尽全力为您解决问题",
    "客服"=>"客服QQ:3399769530，客服微信:cm3399769530",
    "缴费"=>"您好，后台内有缴费入口:[我的账号]->[后台缴费]->[选择套餐]->[购买卡密]->[使用卡密]，以上就是缴费的具体步骤，如果还有问题，请联系后台客服",
    "卡密缴费"=>"你好，如果出现卡密使用不了等问题，请联系客服进行解决。请回复[联系客服]，来查看客服的联系方式",
    "对接源码"=>"您好，如果对接源码无法导入，那么请前往[互动空间]置顶帖找到对接源码的下载链接，手动下载后导入到iapp即可",
    "免费的吗"=>"后台是收费运营的，因为我们服务器也不便宜，为了长久运营，后台每个月收费是3元",
    "骂人"=>"骂人是不好的哦",
    "你好"=>"你好，很高兴为您服务，如果有问题请直接向我提问即可",
    "哈哈"=>"遇到什么高兴的事了吗，看您这么开心~",
    "怎么对接"=>"对接方法有很多，你可以参考后台首页的[开发文档]，里面有GET提交入口和代码演示，或者在后台的[对接源码]里面导入现成的iApp对接源码进行参考，接着完成对接",
    "后台介绍"=>"易对接后台是一款专门的iApp后台，可以通过易对接后台来对接属于你的软件，使管理更加便捷",
    "喜欢"=>"这个不能告诉你喔~",
    "吃饭"=>"好几天没吃饭了，你续费一次我就可以吃一顿饭~",
    "心情"=>"本来心情不怎么好，不过你和我说话后我心情就变好了",
    "你是"=>"我是易对接后台的机器人客服哦，有什么问题尽管和我说，我会尽全力为您寻找答案",
    "福利"=>"福利正在准备中~",
    "加群"=>"易对接后台交流群聊：631781661",
    "支付系统"=>"支付系统因为某些原因，现已关闭，您可以用发卡网，代刷网等网站销售卡密，后台交流群内有视频教程",
    "投稿功能"=>"如果希望后台添加某个功能的话，可以到[后台首页]上方的轮播图找到投稿功能的入口",
    "忘记密码"=>"如果你忘记了后台密码，可以通过联系客服的方式进行找回，如果是用户忘记了密码，可以在后台的[用户管理]里面查找相关用户对其密码进行修改",
];

$problem = [
    "开发者"=>$key["作者"],
    "作者"=>$key["作者"],
    "后台谁开发的"=>$key["作者"],

    "域名"=>$key["域名"],
    "appdoc.top"=>$key["域名"],
    "iappn.com"=>$key["域名"],

    "官网链接"=>$key["官网"],
    "后台官网"=>$key["官网"],
    "后台链接"=>$key["官网"],
    "后台下载"=>$key["官网"],


    "在吗"=>$key["在不"],
    "在?"=>$key["在不"],
    "在不在"=>$key["在不"],
    "在么"=>$key["在不"],

    "客服"=>$key["客服"],
    "售后"=>$key["客服"],
    "联系方式"=>$key["客服"],

    "后台缴费"=>$key["缴费"],
    "后台充值"=>$key["缴费"],
    "怎么续费"=>$key["缴费"],
    "怎么充值"=>$key["缴费"],
    "哪里充值"=>$key["缴费"],
    "我想缴费"=>$key["缴费"],
    "购买卡密"=>$key["缴费"],

    "卡密用不了"=>$key["卡密缴费"],
    "卡密用了没反应"=>$key["卡密缴费"],
    "卡密怎么用"=>$key["卡密缴费"],
    "使用卡密没用"=>$key["卡密缴费"],

    "对接源码导入不了"=>$key["对接源码"],
    "导入没反应"=>$key["对接源码"],

    "后台是免费的吗"=>$key["免费的吗"],
    "这个后台要收费吗"=>$key["免费的吗"],
    "这个软件是免费的吗"=>$key["免费的吗"],

    "草泥马逼的"=>$key["骂人"],
    "草尼玛逼的"=>$key["骂人"],
    "艹你妈逼的"=>$key["骂人"],
    "煞笔东西"=>$key["骂人"],
    "傻逼东西"=>$key["骂人"],
    "你是傻狗吗"=>$key["骂人"],
    "我日你妈个逼"=>$key["骂人"],
    "我干死你要不要"=>$key["骂人"],
    "你是脑瘫吗"=>$key["骂人"],
    "卧槽你妈的"=>$key["骂人"],

    "你好"=>$key["你好"],
    "hello"=>$key["你好"],
    "早上好"=>$key["你好"],
    "中午好"=>$key["你好"],
    "下午好"=>$key["你好"],
    "晚上好"=>$key["你好"],

    "哈哈"=>$key["哈哈"],
    "呵呵"=>$key["哈哈"],
    "嘿嘿"=>$key["哈哈"],

    "怎么对接"=>$key["怎么对接"],
    "不会对接"=>$key["怎么对接"],
    "想要对接"=>$key["怎么对接"],
    "如何对接"=>$key["怎么对接"],

    "运营多久了"=>$key["运营时长"],
    "运行多久了"=>$key["运营时长"],
    "不会跑路"=>$key["运营时长"],
    "上市时间"=>$key["运营时长"],

    "后台介绍"=>$key["后台介绍"],
    "后台怎么用"=>$key["后台介绍"],
    "后台有什么用"=>$key["后台介绍"],
    "这个后台干嘛的"=>$key["后台介绍"],
    "这个软件干嘛的"=>$key["后台介绍"],

    "你喜欢谁"=>$key["喜欢"],
    "有喜欢的人吗"=>$key["喜欢"],

    "吃饭了吗"=>$key["吃饭"],
    "有没有吃饭"=>$key["吃饭"],

    "你心情怎么样"=>$key["心情"],
    "心情好吗"=>$key["心情"],

    "你是谁啊"=>$key["你是"],
    "你是什么东西"=>$key["你是"],

    "有没有福利"=>$key["福利"],
    "有没有送东西"=>$key["福利"],

    "交流群号多少"=>$key["加群"],
    "官方群聊"=>$key["加群"],

    "支付系统用不了"=>$key["支付系统"],
    "支付不了啊"=>$key["支付系统"],

    "投稿功能"=>$key["投稿功能"],
    "功能投稿"=>$key["投稿功能"],
    "加一个功能"=>$key["投稿功能"],
    "为什么没功能"=>$key["投稿功能"],
    "没有这个功能吗"=>$key["投稿功能"],

    "密码忘了怎么办"=>$key["忘记密码"],
    "密码想不起来了"=>$key["忘记密码"],
];
$problem["{count_key}"] =count($key);
$problem["{count_problem}"] =count($problem);

class query{
    public $say;
    public $problem;
    public $select;
    public $result;
    public $count_key;
    public $count_problem;

    function __construct($say,$problem){
        $this->say = $say;
        $this->problem = $problem;
        $this->select = [];
        $this->result = [];
        $this->select_sub = ["value"=>0,"value_max"=>0];
        $this->count_problem = $problem["{count_problem}"];
        $this->count_key = $problem["{count_key}"];
    } //初始化

    function select(){
        foreach($this->problem as $key=>$value){
             $this->select_sub["value"] = similar_text($this->say,$key,$this->select[$key]);
            if($this->select_sub["value_max"] < $this->select_sub["value"]){
                $this->select_sub["value_max"] = $this->select_sub["value"];
            }
            
            if(!isset($this->result["key"])) {
                $this->result = ["key" => $key, "value" => $this->select[$key]];
            }else if($this->result["value"] < $this->select[$key]){
                $this->result = ["key" => $key, "value" => $this->select[$key]];
            }
        }
    } //选择语句

    function result(){
        $this->select();

        if($this->result["value"] <= 50 || $this->select_sub["value_max"] <= 3 || preg_match("/[{]|[}]]/",$this->result["key"]))return "sorry，我翻阅了".$this->count_problem."个词库和".$this->count_key."个答案都未找出合适的回复";
        return $this->problem[$this->result["key"]];
    } //输出语句
}

$say = isset($_GET["say"])?$_GET["say"]:null;
if(preg_match("/[{]|[}]|[-]/",$say) || $say == null)die("你说这谁懂啊~");
die((new query($say,$problem))->result());